fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьРеквизитыДляАбонента();
	
КонецПроцедуры	
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		//ДобавитьРеквизитыДляАбонента();
		УстановитьВидимостьНовыхЭлементовФормы(Форма)
	Иначе
		Отказ;
	КонецЕсли;	
КонецПроцедуры	
&НаСервере
Процедура ДобавитьРеквизитыДляАбонента()
	ГруппаАбонент = Элементы.Найти("ГруппаАбонент");
	Если ГруппаАбонент = Неопределено Тогда
	ГруппаАбонент = Элементы.Добавить("ГруппаАбонент",Тип("ГруппаФормы"),ЭтотОбъект);
		ГруппаАбонент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаАбонент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаАбонент.ОтображатьЗаголовок = Ложь;
		ГруппаАбонент.Отображение = ОтображениеОбычнойГруппы.Нет; 	
	КонецЕсли;
		
		Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"),ГруппаАбонент);		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Сумма абонентской платы"; 
	КонецЕсли;
	
	//Если Элементы.Найти("СтоимостьЧасаРаботыСпециалиста") = Неопределено Тогда
		//НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаАбонент);		
		//НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		//НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";  
	//КонецЕсли;
			
	//Если Элементы.Найти("ПериодДействияДоговора") = Неопределено Тогда
		//НовыйЭлемент = Элементы.Добавить("ПериодДействияДоговора", Тип("ПолеФормы"),ГруппаАбонент);		
		//НовыйЭлемент.ПутьКДанным = "ПериодДействияДоговора";
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//	НовыйЭлемент.Заголовок = "Период действия договора";
	//КонецЕсли;
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
	УстановитьВидимостьНовыхЭлементовФормы(ЭтотОбъект);		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьНовыхЭлементовФормы(Форма)     
	
	Форма.Элементы.ГруппаАбонент.Видимость =  Истина;
	
КонецПроцедуры
